// Модуль формы документа Документ.ДоговорАренды.ФормаДокумента.
// Назначьте событие поля Автомобиль:
// ПриИзменении = АвтомобильПриИзменении

&НаКлиенте
Процедура АвтомобильПриИзменении(Элемент)
    Объект.ЦенаЗаСутки = ПолучитьЦенуАвтомобиля(Объект.Автомобиль);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЦенуАвтомобиля(Автомобиль)

    Если Не ЗначениеЗаполнено(Автомобиль) Тогда
        Возврат 0;
    КонецЕсли;

    Возврат Автомобиль.ЦенаЗаСутки;

КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

    Если ЗначениеЗаполнено(Объект.Автомобиль)
        И Объект.ЦенаЗаСутки = 0 Тогда
        Объект.ЦенаЗаСутки = Объект.Автомобиль.ЦенаЗаСутки;
    КонецЕсли;

КонецПроцедуры
