// Модуль общей формы ОбщаяФорма.ГлавноеМеню.
// Создайте на форме команды и назначьте им эти обработчики.

&НаКлиенте
Процедура ОткрытьДоговорыАренды(Команда)
    ОткрытьФорму("Документ.ДоговорАренды.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЗакрытиеАренды(Команда)
    ОткрытьФорму("Документ.ФактПроката.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьАвтомобили(Команда)
    ОткрытьФорму("Справочник.Автомобили.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКлиенты(Команда)
    ОткрытьФорму("Справочник.Клиенты.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьТарифы(Команда)
    ОткрытьФорму("Справочник.Тарифы.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЦеныПроката(Команда)
    ОткрытьФорму("Документ.ЦеныПроката.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчеты(Команда)
    ОткрытьФорму("ОбщаяФорма.МенюОтчетов");
КонецПроцедуры
